#+AUTHOR: Sebastian Rauschert, PhD
#+TITLE: Prepare VARPP/RuleFit data
#+DATE: 17.09.2020

*** Create the pathogenic file
Now, we can create the final pathogenic file. We first extract the allele frequencies across all populations:

*IMPORTANT*
The sort command requires the ~-g~ setting, as this includes scientific numbers as well. The reason I did not simply use the same bcftools filter command I used further down in the benign variants is, that the condition would be ~AF_X > 0.01 & AF_Y >0.01~ etc. Including all possible ~AF_~ in the gnomAD file. However, not all rows contain the same AF's and that means the condition of all AF_'s in the gnomAD file are not true, even though all given AF_'s for this row are indeed >0.01. The below code is inefficiently slow on larger scales, but for the relatively small number of pathogenic variants (~8,0000), this works still very fast ( ~1-2 minutes).
#+BEGIN_SRC bash
# Enter the pathogenic file directory
cd ../pathogenic_file

# Create the gnomAD annotated pathogenic bedfile
cat patho_gnomAD | awk {'print $1, $2, $3, $4, $5, $13'} | tr ' ' '\t' > pathogenic_gnomAD.bed
# This is a note: TEST.bed | awk {'print $1, $2, $3, $4, $5, $6, $14'} | tr ' ' '\t' > correct_patho_gnomAD.bed
# TEST is actually the correct data. We have selected all -a locations in bedtools rather than only overlapping 
# Create a file that will contain the AF values
touch AF_values_gnomAD.txt

# specify the gnomAD annotated pathogenic file we created above
filename='pathogenic_gnomAD.bed'

# Read the gnomAD annotated file line by line and extract the maximum allele frequency for every entry
# NOTE: we need to exclude AF_raw, as thsi is not a population specific value. Hence, 'grep -v'.
while read line; do
    if  echo "$line" | egrep -q 'AF_[^;]+'
    then  echo $line | egrep -o 'AF_[a-zA-Z]*[(:?_a-zA-Z)]*[=][-+]?[0-9]*\.?[0-9]*[^;]+' | grep -v 'AF_raw' | cut -d "=" -f2 | sort -g -r | head -n 1 >>  AF_values_gnomAD.txt
    else echo "NA" >>  AF_values_gnomAD.txt
    fi
    done < "$filename"
#+END_SRC

#+RESULTS:



As we have NAs and numbers in the AF column, I need to write a script to get those lines that have an NA or a value <=0.01

#+BEGIN_SRC sh
# Enter the pathogenic directory again
cd ../pathogenic_file

# remove the last column from the gnomAD annotated bedfile, as it contains the whole string of 
# allele frequencies which we do not need, as we have the maximum allele frequency extracted now.
#cat pathogenic_gnomAD.bed | awk {'print $1, $2, $3, $4, $5, $6'} > patho_2
cat patho_gnomAD | awk {'print $1, $2, $3, $4, $5'} > patho_2 

# Add the maximum allele frwquency as a column to the pathogenic variant file
#paste -d'\t' patho_2 AF_values_gnomAD.txt  | awk {'print $1, $2, $3, $5, $6, $4, $7'} | tr ' ' '\t' > PATHOGENIC
paste -d'\t' patho_2 AF_values_gnomAD.txt  | tr ' ' '\t' > PATHOGENIC
# this awk command replaces values; in replacing the NA with 0, I make sure the allele frequency of those very rare variants will stay in 
# The gsub command is taken from this website : https://www.cyberciti.biz/faq/awk-find-and-replace-fields-values/
cat PATHOGENIC | awk {'gsub("NA","0",$6); print'} | tr ' ' '\t' | /home/ubuntu/bedtools merge -i - -c 4,5,6 -o max,max,max | awk {'if($6 <=0.01) {print}'} > PATHOGENIC_merged
rm PATHOGENIC
mv PATHOGENIC_merged PATHOGENIC

# Add a header row
sed -e'1i\CHROM\tSTART\tEND\tCADD_RAW_SCORE\tCADD_SCALED\tGNOMAD_AF' PATHOGENIC > PATHO_FINAL

# Remove redundant files
rm patho_2
#rm AF_values_gnomAD.txt
rm PATHOGENIC
mv PATHO_FINAL PATHOGENIC

cat PATHOGENIC | sed '1d' | cut -f1,2,3,4,5 | tr ' ' '\t' > PATHOGENIC.bed


echo 'Pathogenic variant file created!!!'
#+END_SRC

#+RESULTS:
: Pathogenic variant file created!!!

*** First we get all the different AF names to filter by

#+BEGIN_SRC sh :results output
cd ../gnomAD

gunzip -c gnomad.genomes.r3.0.sites.vcf.bgz | head -n 300 | egrep -o "AF_[a-zA-Z]*[(:?_a-zA-Z)]*" | tr '\n' '\t'

#+END_SRC

#+RESULTS:
: AF_asj_female	AF_eas_female	AF_afr_male	AF_female	AF_fin_male	AF_oth_female	AF_ami	AF_oth	AF_male	AF_ami_female	AF_afr	AF_eas_male	AF_sas	AF_nfe_female	AF_asj_male	AF_raw	AF_oth_male	AF_nfe_male	AF_asj	AF_amr_male	AF_amr_female	AF_sas_female	AF_fin	AF_afr_female	AF_sas_male	AF_amr	AF_nfe	AF_eas	AF_ami_male	AF_fin_female	

